#+TITLE: lecture 8: automatic differentiation
#+AUTHOR: James Gilles
#+EMAIL: jhgilles@mit.edu
#+DATE: September 17 2019
#+OPTIONS: tex:t latex:t
#+STARTUP: latexpreview

** back towards AD
   given the above, what information do we need to calculate derivatives of combined functions on a computer?

   we only need: $f(a)$ and $f'(a)$ for each $f$, at point $a$

   (*sanders*: why is this enough? well, it's a first-order taylor expansion, so we only have access to first-order information)

   in the computer; we'll represent this data with a pair of numbers $(f(a), f'(a))$ for each $f$

   what data structures do we use here?
   - tuple
   - vector / list
   - (*jhg*: struct of arrays? *sanders*: nothing so complicated...)
   - ...introduce a new type! because new behaviour. (*sanders*: behaviour has a "u" in it.)

   in julia:

#+BEGIN_SRC jupyter-julia :session jl :async yes
using Base
struct SimpleDual # "dual number"
    val :: Float64
    der :: Float64
end

f = SimpleDual(3, 4)
g = SimpleDual(5, 6)

#+END_SRC

   #+RESULTS:
   : SimpleDual(5.0, 6.0)

   note: each dual can represent a *huge* (*sanders*: uncountable??) number of possible functions!

   now, what happens if we add these things?

  #+BEGIN_SRC jupyter-julia :session jl :async yes
f + g
  #+END_SRC

  #+RESULTS:
  :RESULTS:
  # [goto error]
  : MethodError: no method matching +(::SimpleDual, ::SimpleDual)
  : Closest candidates are:
  :   +(::Any, ::Any, !Matched::Any, !Matched::Any...) at operators.jl:529
  :
  : Stacktrace:
  :  [1] top-level scope at In[4]:1
  :END:

  julia hasn't been taught to add these things...

  #+BEGIN_SRC jupyter-julia :session jl :async yes
+(f :: SimpleDual, g :: SimpleDual) = SimpleDual(f.val + g.val, f.der + g.der)
f + g
  #+END_SRC

  #+RESULTS:
  : Dual{Int64}(8, 10)

  so now we've encoded a rule from calculus in julia!

  let's make it generic:

#+BEGIN_SRC jupyter-julia :session jl :async yes
struct Dual{T <: Number}
    val :: T
    der :: T
end
Base.:+(f :: Dual, g :: Dual) = Dual(f.val + g.val, f.der + g.der)
Base.:*(f :: Dual, alpha :: Number) = Dual(f.val * alpha, f.der * alpha)
Base.:*(alpha::Number, f :: Dual) = Dual(f.val * alpha, f.der * alpha)

f = Dual(3, 4)
g = Dual(5, 6)
f + g
#+END_SRC

#+RESULTS:
: Dual{Int64}(8, 10)

  now, derivatives:

#+BEGIN_SRC jupyter-julia :session jl :async yes
h(x) = x * x + 2.0x
xx = Dual(3.0, 1.0)
h(xx)
#+END_SRC

#+RESULTS:
: Dual{Float64}(15.0, 8.0)

  we've now encoded standard differentiation in a computer!

  (this is *forward-mode* differentiation.)

